In [1]:
#Importing Libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
data = pd.read_csv("train.csv")

In [3]:
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [4]:
attributes = []
for i in data.keys():
    attributes.append(i)
    
print("The features are\n {}".format(attributes))

The features are
 ['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [7]:
Y = data['Survived']

In [8]:
#The Feature Attributes which we will be using are Class, Sex, Age, Fare.... We are leaving Cabin because too much missing data

## Data Preprocessing

In [9]:
X = data[['Pclass', 'Sex', 'Age', 'Fare']]

In [10]:
#Removing Null Values from Age
age = []
for i in X['Age']:
    if(pd.isnull(i) == False):
        age.append(i)
        
age = pd.DataFrame(age, columns = ['Age'])

In [11]:
len(age)

714

In [12]:
del X['Age']
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  891 non-null    int64
 1   Sex     891 non-null    object
 2   Fare    891 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 21.0+ KB

In [13]:
X = X.drop(X.index[714:892])

In [14]:
X.head(3)

   Pclass     Sex     Fare
0       3    male   7.2500
1       1  female  71.2833
2       3  female   7.9250

In [15]:
age.head(3)

    Age
0  22.0
1  38.0
2  26.0

In [16]:
len(X), len(age)

(714, 714)

In [17]:
#Creating dummy values 
dummy_df = pd.get_dummies(X, columns = ['Sex'], prefix = 'Sex Is')

In [19]:
del X['Sex']

     Pclass     Fare
0         3   7.2500
1         1  71.2833
2         3   7.9250
3         1  53.1000
4         3   8.0500
..      ...      ...
709       3  15.2458
710       1  49.5042
711       1  26.5500
712       1  52.0000
713       3   9.4833

[714 rows x 2 columns]

In [21]:
dummy_df

     Pclass     Fare  Sex Is_female  Sex Is_male
0         3   7.2500              0            1
1         1  71.2833              1            0
2         3   7.9250              1            0
3         1  53.1000              1            0
4         3   8.0500              0            1
..      ...      ...            ...          ...
709       3  15.2458              0            1
710       1  49.5042              1            0
711       1  26.5500              0            1
712       1  52.0000              0            1
713       3   9.4833              0            1

[714 rows x 4 columns]

In [24]:
del dummy_df['Pclass']
del dummy_df['Fare']

In [25]:
dummy_df

     Sex Is_female  Sex Is_male
0                0            1
1                1            0
2                1            0
3                1            0
4                0            1
..             ...          ...
709              0            1
710              1            0
711              0            1
712              0            1
713              0            1

[714 rows x 2 columns]

In [27]:
X = X.join(dummy_df)

In [28]:
#Joining both dataframes to form a new one
X = X.join(age)

In [29]:
X.head(1)

   Pclass  Fare  Sex Is_female  Sex Is_male   Age
0       3  7.25              0            1  22.0

In [30]:
X.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 0 to 713
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Pclass         714 non-null    int64
 1   Fare           714 non-null    float64
 2   Sex Is_female  714 non-null    uint8
 3   Sex Is_male    714 non-null    uint8
 4   Age            714 non-null    float64
dtypes: float64(2), int64(1), uint8(2)
memory usage: 43.7 KB

In [31]:
Y = Y.drop(Y.index[714:892])

### Predictive Modelling

In [55]:
from sklearn.tree import DecisionTreeClassifier
clf = DecisionTreeClassifier(criterion = 'entropy')
clf.fit(X, Y)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='entropy',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

#### Kaggle Submission

In [61]:
test = pd.read_csv('test.csv')
sub = pd.read_csv('gender_submission.csv')

In [62]:
test.head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [63]:
X.head(1)

   Pclass  Fare  Sex Is_female  Sex Is_male   Age
0       3  7.25              0            1  22.0

In [64]:
sub.head(1)

   PassengerId  Survived
0          892         0

In [68]:
test.iloc[0]['PassengerId']

892

In [69]:
#Creating dummy values 
dummy_df = pd.get_dummies(test, columns = ['Sex'], prefix = 'Sex Is')

In [71]:
del test['Sex']

In [74]:
dummy_df = dummy_df.drop(['PassengerId', 'Pclass', 'Name', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'], axis =1)

In [77]:
test = test.join(dummy_df)

In [78]:
test.head(1)

,PassengerId,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex Is_female,Sex Is_male
0,892,3,"Kelly, Mr. James",34.5,0,0,330911,7.8292,NaN,Q,0,1

In [79]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   PassengerId    418 non-null    int64
 1   Pclass         418 non-null    int64
 2   Name           418 non-null    object
 3   Age            332 non-null    float64
 4   SibSp          418 non-null    int64
 5   Parch          418 non-null    int64
 6   Ticket         418 non-null    object
 7   Fare           417 non-null    float64
 8   Cabin          91 non-null     object
 9   Embarked       418 non-null    object
 10  Sex Is_female  418 non-null    uint8
 11  Sex Is_male    418 non-null    uint8
dtypes: float64(2), int64(4), object(4), uint8(2)
memory usage: 33.6+ KB

In [93]:
age_array =[]
for i in test['Age']:
    if(pd.isnull(i)==True):
        age_array.append(test['Age'].mean())
    else:
        age_array.append(i)
        
fare_array = []
for i in test['Fare']:
    if(pd.isnull(i) == True):
        fare_array.append(test['Fare'].mode())
    else:
        fare_array.append(i)

In [94]:
len(age_array), len(fare_array)

(418, 418)

In [97]:
age = pd.DataFrame(age_array, columns = ['Age'])
fare = pd.DataFrame(fare_array, columns = ['Fare'])

In [101]:
test = test.drop(['Fare', 'Age'], axis = 1)

In [111]:
test = test.join(age)

In [112]:
test = test.join(fare)

In [113]:
test.head(1)

,PassengerId,Pclass,Name,SibSp,Parch,Ticket,Cabin,Embarked,Sex Is_female,Sex Is_male,Age,Fare
0,892,3,"Kelly, Mr. James",0,0,330911,NaN,Q,0,1,34.5,7.8292

In [114]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   PassengerId    418 non-null    int64
 1   Pclass         418 non-null    int64
 2   Name           418 non-null    object
 3   SibSp          418 non-null    int64
 4   Parch          418 non-null    int64
 5   Ticket         418 non-null    object
 6   Cabin          91 non-null     object
 7   Embarked       418 non-null    object
 8   Sex Is_female  418 non-null    uint8
 9   Sex Is_male    418 non-null    uint8
 10  Age            418 non-null    float64
 11  Fare           418 non-null    object
dtypes: float64(1), int64(4), object(5), uint8(2)
memory usage: 33.6+ KB

In [166]:
z = test.loc[1][['Age', 'Fare', 'Pclass', 'Sex Is_male', 'Sex Is_female']]
z = np.asarray(z)

In [167]:
z = z.reshape(1,z.shape[0])

In [168]:
z.shape

(1, 5)

In [169]:
z

array([[47.0, 7.0, 3, 0, 1]], dtype=object)

In [170]:
z = pd.DataFrame(z, columns = ['Age', 'Fare', 'Pclass', 'Sex Is_male', 'Sex Is_female'])

In [171]:
z

  Age Fare Pclass Sex Is_male Sex Is_female
0  47    7      3           0             1

In [181]:
clf.predict(z)[0]

0

In [182]:
Passenger = []
Survived = []

for i in range(0,418):
    val = test.loc[i][['Age', 'Fare', 'Pclass', 'Sex Is_male', 'Sex Is_female']]
    val = np.asarray(val)
    val = val.reshape(1, val.shape[0])
    val = pd.DataFrame(val, columns = ['Age', 'Fare', 'Pclass', 'Sex Is_male', 'Sex Is_female'])
    Passenger.append(test.loc[i]['PassengerId'])
    Survived.append(clf.predict(val)[0])

In [186]:
len(Passenger), len(Survived)

(418, 418)

In [206]:
df1 = pd.DataFrame(Passenger, columns =['PassengerId'])
df2 = pd.DataFrame(Survived, columns = ['Survived'])

In [207]:
df1 = df1.join(df2)
final = df1

In [208]:
final.to_csv('submissions.csv', index = False)